app/Models/ProductModel.php

SELECT *
FROM `products`
---
    public function getAll()
    {
        return $this->findAll();

SELECT *
FROM `products`
WHERE `name` LIKE '%will%' ESCAPE '!'
OR  `description` LIKE '%will%' ESCAPE '!'
---
    public function searchMethod($query, $category)
    {
        return $this->like('name', $query)
            ->orLike('description', $query)
            ->when($category, function ($builder) use ($category) {
                return $builder->orLike('category', $category);
            })
            ->findAll();

SELECT *
FROM `products`
WHERE `id` = 2
 LIMIT 1
---
    public function product($id)
    {
        return $this->where('id', $id)->first();